#!/usr/bin/env perl

     #8888#           #8888#
   #88888888#       #88888888#
  use utf8;;use   List::Util qw
 {sum};use POSIX;;binmode(STDOUT,
 ':utf8');$|++;$l=0;$t=sum map{1}
 split//,<DATA>;print`tput rmam`;
 $q=qx[tput cols];print' 'x($q/2-
 8);print"j't'aime Louise\x{2764\
 }";sleep 3;print"\033[2K\033[0G"
 ;for(split//,$r='ûùćōŋŊćĺŁņćĽņŎøňĽŊńââøøøøøûĐĐĐĐûøøøøøøøøøøøûĐĐĐĐûâøøøûĐĐĐĐĐĐĐĐûøøøøøøøûĐĐĐĐĐĐĐĐûâøøōŋĽøōŌľĐēēōŋĽøøøĤŁŋŌĒĒĭŌŁńøŉŏâøœŋōŅŕēōŋĽøĨħīġİēēĺŁņŅŇļĽĀīĬĜħĭĬĄâøÿĒōŌľĐÿāēüŔăăēüńĕĈēüŌĕŋōŅøŅĹňœĉŕâøŋňńŁŌććĄĔĜęĬęĖēňŊŁņŌĸŌňōŌøŊŅĹŅĸēâøüŉĕŉŐĳŌňōŌøĻŇńŋĵēňŊŁņŌÿøÿŐĀüŉćĊąâøĐāēňŊŁņŌúłÿŌÿĹŁŅĽøĤŇōŁŋĽĴŐœĊďĎČĴâøŕúēŋńĽĽňøċēňŊŁņŌúĴĈċċĳĊģĴĈċċĳĈğúâøēľŇŊĀŋňńŁŌććĄüŊĕÿĶÿāœâøøüŋĕĻŀŊĀŇŊļĀüķāąĻĽŁńĀüŌĂĎĆċčāāēâøøøøŁľĀüœŋŕĽŉÿĶÿĹņļüńøùĕĉāøøœâøøøøøøňŊŁņŌüŊĄĄĄēüńĕĉŕĽńŋĽœâøøøøøøøňŊŁņŌüŋŕēŕûġøľĻŃŁņĿâøøøøøøøøøûńŇŎĽûûûûûûûûûûâøøøøøøøøøøøûûûûőŇōûûûûâøøøøøøøøøøøøøûûûûûûâøøøøøøøøøøøøøøøûûââķķĜęĬęķķâĻŇņĻĽŁŎĽļøŏŁŌŀøńŇŎĽøĺőøļĽŅŇŋŌĹņŁŋâ'){
  $s=chr(ord($_)-ceil($t*6.35));
    if(${s}eq'^'and$l !=1)  {
      print$r,,,;$l=1}else{
       print$s};}#I fcking
         #love##########
           ####you####
             ######
               ##

__DATA__
conceived with love by demostanis
